In [1]:
import numpy as np
import pandas as pd

In [3]:
user = pd.DataFrame({'userid' : [1,2,3], 'name' : ['A','B','C']})
user

   userid name
0       1    A
1       2    B
2       3    C

In [4]:
msg = pd.DataFrame({'id' : [1,1,2], 'msg' : ['hello','bye','hi']})
msg

   id    msg
0   1  hello
1   1    bye
2   2     hi

In [5]:
user = pd.read_csv('user.csv')
user

   userid name
0       1    A
1       2    B
2       3    C

In [6]:
msg = pd.read_csv('msg.csv')
msg

   id    msg
0   1  hello
1   1    bye
2   2     hi

  # Concat

In [7]:
pd.concat([user,msg])

   userid name   id    msg
0     1.0    A  NaN    NaN
1     2.0    B  NaN    NaN
2     3.0    C  NaN    NaN
0     NaN  NaN  1.0  hello
1     NaN  NaN  1.0    bye
2     NaN  NaN  2.0     hi

In [8]:
pd.concat([user,msg],axis=1)   # changing the default axis

   userid name  id    msg
0       1    A   1  hello
1       2    B   1    bye
2       3    C   2     hi

  # Merge

In [ ]:
 # data on left is msg
 # data on right is user

In [9]:
msg.merge(user,left_on='id',right_on='userid')     # finding the common columns

   id    msg  userid name
0   1  hello       1    A
1   1    bye       1    A
2   2     hi       2    B

In [10]:
msg

   id    msg
0   1  hello
1   1    bye
2   2     hi

In [11]:
user

   userid name
0       1    A
1       2    B
2       3    C

In [12]:
msg.merge(user,left_on = 'id',right_on = 'userid', how = 'inner')  # how = inner is the default,works like Intersection

   id    msg  userid name
0   1  hello       1    A
1   1    bye       1    A
2   2     hi       2    B

In [13]:
msg.merge(user,left_on = 'id',right_on = 'userid',how='outer')    # how = 'outer' is the default,works like union

    id    msg  userid name
0  1.0  hello       1    A
1  1.0    bye       1    A
2  2.0     hi       2    B
3  NaN    NaN       3    C

In [14]:
msg.merge(user,left_on = 'id', right_on = 'userid', how='left')

   id    msg  userid name
0   1  hello       1    A
1   1    bye       1    A
2   2     hi       2    B

In [15]:
msg.merge(user,left_on='id',right_on ='userid',how='right')

    id    msg  userid name
0  1.0  hello       1    A
1  1.0    bye       1    A
2  2.0     hi       2    B
3  NaN    NaN       3    C

In [16]:
# We can drop the duplicate rows
msg.merge(user,left_on = 'id',right_on = 'userid',how='right').drop('id',axis=1)

     msg  userid name
0  hello       1    A
1    bye       1    A
2     hi       2    B
3    NaN       3    C